Reports/Снабжение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>Снабжение</Name>
		</Properties>
	</Report>
</MetaDataObject>

Documents/ЗаказыПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказыПоставщику</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаказПоставщику</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/Снабжение/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьНаСервере()
	тзДанные = ПолучитьДанные();
	ВывестиДанные(тзДанные);
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанные()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПотребностьВМатериалахОбороты.Номенклатура КАК Номенклатура,
	//	|	ПотребностьВМатериалахОбороты.ПотребностьОборот КАК ПотребностьОборот
	//	|ПОМЕСТИТЬ вт
	//	|ИЗ
	//	|	РегистрНакопления.ПотребностьВМатериалах.Обороты(, , , ИзделиеКомплект В (&ИзделиеКомплект)) КАК ПотребностьВМатериалахОбороты
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ОстаткиТоваровНаСкладахОстатки.Номенклатура КАК Номенклатура,
	//	|	ОстаткиТоваровНаСкладахОстатки.КоличествоОстаток КАК Остаток
	//	|ПОМЕСТИТЬ втОстатки
	//	|ИЗ
	//	|	РегистрНакопления.ОстаткиТоваровНаСкладах.Остатки КАК ОстаткиТоваровНаСкладахОстатки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ОстаткиТоваровНаСкладахОбороты.Номенклатура КАК Номенклатура,
	//	|	ОстаткиТоваровНаСкладахОбороты.КоличествоРасход КАК КоличествоРасход
	//	|ПОМЕСТИТЬ втВыданно
	//	|ИЗ
	//	|	РегистрНакопления.ОстаткиТоваровНаСкладах.Обороты(, , , ИзделиеКомплект В (&ИзделиеКомплект)) КАК ОстаткиТоваровНаСкладахОбороты
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ЗаказПоставщикуОстатки.Номенклатура КАК Номенклатура,
	//	|	ЗаказПоставщикуОстатки.КоличествоОстаток КАК КоличествоОстаток
	//	|ПОМЕСТИТЬ втЗаказ
	//	|ИЗ
	//	|	РегистрНакопления.ЗаказПоставщику.Остатки(, ИзделиеКомплект В (&ИзделиеКомплект)) КАК ЗаказПоставщикуОстатки
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	вт.Номенклатура КАК Номенклатура,
	//	|	вт.ПотребностьОборот КАК Потребность,
	//	|	ЕСТЬNULL(втОстатки.Остаток, 0) КАК Остаток,
	//	|	вт.Номенклатура.Артикул КАК Артикул,
	//	|	вт.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
	//	|	ЕСТЬNULL(втЗаказ.КоличествоОстаток, 0) КАК Заказано,
	//	|	ЕСТЬNULL(втВыданно.КоличествоРасход, 0) КАК Выдано
	//	|ИЗ
	//	|	вт КАК вт
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
	//	|		ПО вт.Номенклатура = втОстатки.Номенклатура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ втВыданно КАК втВыданно
	//	|		ПО вт.Номенклатура = втВыданно.Номенклатура
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ втЗаказ КАК втЗаказ
	//	|		ПО вт.Номенклатура = втЗаказ.Номенклатура";
	//
	//
	//Запрос.УстановитьПараметр("ИзделиеКомплект",омРассчетИзделияКомплект.ИзделияКомплектБезВыпуска());
	//Возврат Запрос.Выполнить().Выгрузить();
	
	Возврат омРассчетИзделияКомплект.ОпределениеОстаткаПотребности(Неопределено);
КонецФункции // ПолучитьДанные()

&НаСервере
Процедура ВывестиДанные(тзДанные)
	ПолеВывода.Очистить(); 
	
	Макет = Отчеты.Снабжение.ПолучитьМакет("МакетСнабжение");
	
	
	ПолеВывода.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	обСтрока = Макет.ПолучитьОбласть("Строка");
	Номер = 1;
	
	Для каждого х Из тзДанные Цикл
		обСтрока.Параметры.Заполнить(х);
		обСтрока.Параметры.Номер = Номер;
		
		Дефицит = х.Потребность - х.Выдано - х.Остаток - х.Заказано;
		
		Если Дефицит > 0 Тогда
			обСтрока.Параметры.Дефицит = Дефицит;
		Иначе
			обСтрока.Параметры.Дефицит = 0;
		КонецЕсли;
		
		текПотребность = х.Потребность- х.Остаток - х.Заказано - х.Выдано;
		текПотребность = ?(текПотребность < 0, -текПотребность, текПотребность);
		обСтрока.Параметры.стВыбор = Новый Структура("Вид,Номенклатура,Остаток,текЗначение","Выбор",х.Номенклатура,текПотребность,0);
		//обСтрока.Параметры.стНоменклатура = Новый Структура("Вид,Описание,Номенклатура","Описание",х.ДопИнформация,х.Номенклатура);

		ПолеВывода.Вывести(обСтрока);
		Номер = Номер  + 1;
	КонецЦикла;

КонецПроцедуры // ВывестиДанные()


&НаКлиенте
Процедура Обновить(Команда)
	ЭтаФорма.тзВыбор.Очистить();
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолеВыводаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если Тип("Структура") = ТипЗнч(Расшифровка) Тогда
		СтандартнаяОбработка = Ложь;
		ВидРасшифровки = Неопределено;
		Если Расшифровка.Свойство("Вид",ВидРасшифровки) Тогда
			Если ВидРасшифровки = "Выбор" Тогда
				стОтбор = Новый Структура("Номенклатура", Расшифровка.Номенклатура);	
				НайденыеСтроки = ЭтаФорма.тзВыбор.НайтиСтроки(стОтбор);	
			    Если НайденыеСтроки.Количество() = 0 Тогда
					НС = ЭтаФорма.тзВыбор.Добавить();
					НС.Номенклатура = Расшифровка.Номенклатура;
					НС.Количество 	= Расшифровка.Остаток;
					Расшифровка.текЗначение = Расшифровка.Остаток; 
				Иначе
				    Если НайденыеСтроки[0].Количество = 0 Тогда
						НайденыеСтроки[0].Количество = Расшифровка.Остаток;
					Иначе
						НайденыеСтроки[0].Количество = 0;
					КонецЕсли;
					Расшифровка.текЗначение = НайденыеСтроки[0].Количество; 
				
				КонецЕсли;
				Элемент.ТекущаяОбласть.Текст = Расшифровка.текЗначение;
			//ИначеЕсли ВидРасшифровки = "Описание" Тогда
			//	СформироватьНаСервереРасшифровку(ЭтаФорма.ПолеРасшифровки,Расшифровка.Описание,Расшифровка.Номенклатура);
			//	Элементы.ГруппаРасшифровки.Видимость = Истина;
			КонецЕсли;	
			
		
		КонецЕсли;
		
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Асинх Процедура ПолеВыводаОбработкаДополнительнойРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если Тип("Структура") = ТипЗнч(Расшифровка) Тогда
		СтандартнаяОбработка = Ложь;
		ВидРасшифровки = Неопределено;
		Если Расшифровка.Свойство("Вид",ВидРасшифровки) Тогда
			Если ВидРасшифровки = "Выбор" Тогда 
				текЗначение = Расшифровка.текЗначение;
				Результат = Ждать ВвестиЧислоАсинх(текЗначение,"Ввидите количиство на более " + Расшифровка.Остаток,10,3);
				СтандартнаяОбработка = Ложь;
				Если Результат = Неопределено Тогда
					Возврат;
				КонецЕсли;
				//Результат = ?(Результат > Расшифровка.Остаток, Расшифровка.Остаток, Результат); 
				стОтбор = Новый Структура("Номенклатура", Расшифровка.Номенклатура);	
				НайденыеСтроки = ЭтаФорма.тзВыбор.НайтиСтроки(стОтбор);	
				Если НайденыеСтроки.Количество() = 0 Тогда
					НС = ЭтаФорма.тзВыбор.Добавить();
					НС.Номенклатура = Расшифровка.Номенклатура;
				Иначе
					НС = НайденыеСтроки[0];
				КонецЕсли;	
				НС.Количество 					= Результат;
				Расшифровка.текЗначение 		= Результат; 
				Элемент.ТекущаяОбласть.Текст 	= Результат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  


&НаКлиенте
Процедура ЗаказатьУ(Команда)
	Если НЕ ЗначениеЗаполнено(ЭтаФорма.Поставщик) Тогда
		ПоказатьПредупреждение(,"Не заполнен поставщик.");
		Возврат;	
	КонецЕсли;
	
	ПоказатьЗначение(,СоздатьДокументЗаказПоставщику(Поставщик));
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Функция СоздатьДокументЗаказПоставщику(Поставщик)

	Док = Документы.ЗаказыПоставщику.СоздатьДокумент();
	Док.Поставщик 	= Поставщик;
	Док.Дата		= ТекущаяДата();
	Для каждого х Из ЭтаФорма.тзВыбор Цикл
		Если х.Количество > 0 Тогда
			ЗаполнитьЗначенияСвойств(Док.Номенклатура.Добавить(),х);
		КонецЕсли;
	КонецЦикла;
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат Док.Ссылка;

КонецФункции // СоздатьДокументЗаказПоставщику()
